In [1]:
a=10
print(a)

10

In [4]:
#trying to use some pandas functions
s = pd.Series([-12,-1,3,5])
s

0   -12
1    -1
2     3
3     5
dtype: int64

In [5]:
#need this line to run pandas as shortcut pd
import pandas as pd

In [6]:
#performing some operations with the array of s 
s + 1000

0     988
1     999
2    1003
3    1005
dtype: int64

In [7]:
s < 0

0     True
1     True
2    False
3    False
dtype: bool

In [8]:
#can change labels in the array as well! 
s2 = pd.Series([100,200,1000000], index = ["broke","John","CardiB"])
s2

broke         100
John          200
CardiB    1000000
dtype: int64

In [9]:
#accessing arrays 
s2[1]
s2["CardiB"]

1000000

In [14]:
#now we get to some cooler stuff like saving data 
my_df = pd.DataFrame(
 [["Eating", 200, 1994, 0], ["Dancing", 83.1, 1984,3]],
    columns = ["hobby", "weight","birthyear","children"],
    index = ["alice", "bob"]
)
my_df

         hobby  weight  birthyear  children
alice   Eating   200.0       1994         0
bob    Dancing    83.1       1984         3

In [15]:
my_df.to_csv("my_df.csv")
my_df.to_html("my_df.html")
my_df.to_json("my_df.json")

In [18]:
#to look at what we actually saved
for filename in ("my_df.csv","my_df.html","my_df.json"):
        print ("#", filename)
        with open (filename, "rt") as f:
                 print(f.read())
                 print()

# my_df.csv
,hobby,weight,birthyear,children
alice,Eating,200.0,1994,0
bob,Dancing,83.1,1984,3


# my_df.html
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>hobby</th>
      <th>weight</th>
      <th>birthyear</th>
      <th>children</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>alice</th>
      <td>Eating</td>
      <td>200.0</td>
      <td>1994</td>
      <td>0</td>
    </tr>
    <tr>
      <th>bob</th>
      <td>Dancing</td>
      <td>83.1</td>
      <td>1984</td>
      <td>3</td>
    </tr>
  </tbody>
</table>

# my_df.json
{"hobby":{"alice":"Eating","bob":"Dancing"},"weight":{"alice":200.0,"bob":83.1},"birthyear":{"alice":1994,"bob":1984},"children":{"alice":0,"bob":3}}

In [19]:
#now to laod a CSV file we do the following
my_df_loaded = pd.read_csv("my_df.csv", index_col = 0)
my_df_loaded

         hobby  weight  birthyear  children
alice   Eating   200.0       1994         0
bob    Dancing    83.1       1984         3

In [20]:
#pretty cool that we can aso do similar things with SQL in here
city_loc = pd.DataFrame(
    [
        ["CA", "San Francisco", 37.781334, -122.416728],
        ["NY", "New York", 40.705649, -74.008344],
        ["FL", "Miami", 25.791100, -80.320733],
        ["OH", "Cleveland", 41.473508, -81.739791],
        ["UT", "Salt Lake City", 40.755851, -111.896657]
    ], columns=["state", "city", "lat", "lng"])
city_loc
#have to say not my fave, but probs pretty useful

  state            city        lat         lng
0    CA   San Francisco  37.781334 -122.416728
1    NY        New York  40.705649  -74.008344
2    FL           Miami  25.791100  -80.320733
3    OH       Cleveland  41.473508  -81.739791
4    UT  Salt Lake City  40.755851 -111.896657